# Задание 2
# Напишите программу, которая запрашивает три целых числа a, b и x и выводит True, если x
# лежит между a и b, иначе – False.
print("This a comparison program.\nYou will be requested to enter 3 integer numbers.")
a=input("Please enter 1-st number > ")
b=input("Please enter 2-nd number > ")
x=input("Please enter 3-rd number > ")
print(int(a)<int(x)<int(b))